Autodesk.Revit.DB.AugmentationGeometryObject.SetUsage(Autodesk.Revit.DB.ExternallyTaggedNonBRepUsage)
Controls the usage of this AugmentationGeometryObject.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.AugmentationGeometryObject.#ctor(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.GeometryObject)
Constructs an AugmentationGeometryObject associating a given ExternalGeometryId with
a particular GeometryObject.
externalId:
The Id of the input geometry object.
geometry:
The externally tagged geometry object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.AugmentationGeometryObject
This class is used to create an augmentation geometry object.
Since:
2024